MT3G/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 1e-10;

boundaryField
{
    inlet
    {
        type            inletOutlet;
        inletValue      uniform 1e-10;
        value           uniform 1e-10;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 1e-10;
        value           uniform 1e-10;
    }
    bottom
    {
        type            epsilonWallFunction;
        value           uniform 1e-10;
        inletValue      uniform 1e-10;
    }
    slope
    {
        type            epsilonWallFunction;
        value           uniform 1e-10;
    }
    defaultFaces
    {
        type            empty;
    }
    atmosphere
    {
        type            inletOutlet;
        inletValue      uniform 1e-10;
        value           uniform 1e-10;
    }
    topLeft //inlet
    {
        type            inletOutlet;
        inletValue      uniform 1e-10;
        value           uniform 1e-10;
    }
    botRight //outlet
    {
        type            inletOutlet;
        inletValue      uniform 1e-10;
        value           uniform 1e-10;
    }
    botLeft //bottom
    {
        type            epsilonWallFunction;
        value           uniform 1e-10;
        inletValue      uniform 1e-10;
    }
    topRight //atmosphere
    {
        type            inletOutlet;
        inletValue      uniform 1e-10;
        value           uniform 1e-10;
    }
}


// ************************************************************************* //
