MT3G/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 9e-12;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 9e-12; //0; //9e-12;
    }
    outlet
    {
        type            calculated;
        value           uniform 9e-12; //0; //9e-12;
    }
    bottom
    {
        type            nutkWallFunction; //calculated;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 9e-12; //0; //9e-12;
    }
    atmosphere
    {
        type            calculated;
        value           uniform 9e-12; //0; //9e-12;
    }
    defaultFaces
    {
        type            empty;
    }
    slope
    {
        type            nutkWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 9e-12; // 0; //9e-12;
    }
    topLeft //inlet
    {
        type            calculated;
        value           uniform 9e-12; //0; //9e-12;
    }
    botRight //outlet
    {
        type            calculated;
        value           uniform 9e-12; //0; //9e-12;
    }
    botLeft //bottom
    {
        type            nutkWallFunction; //calculated;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 9e-12; //0; //9e-12;
    }
    topRight //atmosphere
    {
        type            calculated;
        value           uniform 9e-12; //0; //9e-12;
    }
}


// ************************************************************************* //
