MT3G/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices        
(
    	(-5.9702    0.000   -1.194) // 0
    	(12.1395    0.000   -1.194) // 1
    	(12.1395    0.000   2.5871) // 2
    	(-5.9702    0.000   2.5871) // 3
		/////////////////////////////////
    	(-5.9702    0.020   -1.194) // 4
    	(12.1395    0.020   -1.194) // 5
    	(12.1395    0.020   2.5871) // 6
    	(-5.9702    0.020   2.5871) // 7
);

blocks          
(
    hex (0 1 5 4 3 2 6 7) (2264 1 945) simpleGrading (1 1 1)
);

edges           
(
);

boundary         
(
    inlet 
    {
	type patch;
	faces
    (
		(0 3 7 4)
    );
    }
    bottom 
    {
	type wall;
	faces
    (
        (0 4 5 1)
    );
    }
	outlet
    {
	type wall;
	faces
    (
        (1 5 6 2)
	);
    }
    atmosphere
    {
	type patch;
	faces
    (
        (3 2 6 7)
    );
    }

    frontandback1
    {
    type empty;
    faces
    (
        (0 1 2 3)
    );
    }

	frontandback2
    {
    type empty;
          faces
    (
		(4 7 6 5)
	);
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
